{
  "onceSaleMarkedAsPaid": "Once it's marked as paid, you can't edit the sale anymore.",
  "oncePurchaseMarkedAsPaid": "Once purchase is marked as paid, you can't edit it anymore.",
  "customerName": "Customer name is required. The length must be between 2 and 30 characters.",
  "customerSurname": "Customer surname is required. The length must be between 2 and 30 characters.",
  "emailAddress": "Email address is required.",
  "phoneNumber": "Phone number is required. It must be E.164 format. Example: +12345678901.",
  "addressLine1": "Address line 1 is required. You can type the address and choose the proper one for yourself. Autocomplete on browsers may not work properly.",
  "addressLine2": "Address line 2 is required. The length must be 3-120. Here you can write your apartment number, floor, etc.",
  "supplierName": "Supplier name is required. The length must be between 2 and 30 characters.",
  "supplierSurname": "Supplier surname is required. The length must be between 2 and 30 characters.",
  "productName": "Product name is required. The length must be between 2 and 100 characters.",
  "productDescription": "Product description is optional. The length must be between 3 and 100 characters.",
  "productType": "Product type is required. The length must be between 2 and 30 characters.",
  "productSalePrice": "Product sale price is required. It must min 0.01 and max 1000000.",
  "productPurchasePrice": "Product purchase price is required. It must min 0.01 and max 1000000.",
  "title": "Title is required. The length must be between 2 and 100 characters.",
  "description": "Description is optional. The length must be between 3 and 100 characters.",
  "saleCustomer": "Customer must be selected. If you don't have any customers, you must create one.",
  "saleProduct": "Product must be selected. If you don't have any products, you must create one. If the product is out of stock, you must create a purchase.",
  "saleQuantity": "Quantity is required. It must be minimum 1. The maximum is the product's stock.",
  "purchaseSupplier": "Supplier must be selected. If you don't have any suppliers, you must create one.",
  "purchaseProduct": "Product must be selected. If you don't have any products, you must create one.",
  "purchaseQuantity": "Quantity is required. It must be minimum 1 and maximum 999.",
  "profileName": "Name is required. The length must be between 2 and 30 characters.",
  "profileSurname": "Surname is required. The length must be between 2 and 30 characters.",
  "profileEmail": "Email can't be updated. If you want to change it, you must contact the support team.",
  "profilePhoneNumber": "Phone number is optional. It must be E.164 format. Example: +12345678901.",
  "language": "You can choose the language you want to use. The default language is English.",
  "profileTimezone": "You can choose the timezone you want to use. The default timezone is UTC.",
  "profileCurrency": "You can choose the currency you want to use. The default currency is USD. This currency will be used for all calculations.",
  "currentPassword": "Current password.",
  "newPassword": "New password is the password you want to use. It must be between 6 and 18 characters. It must contain at least one uppercase letter, one lowercase letter and one number. It can't be the same as the current password.",
  "confirmPassword": "Confirm password is the same as the new password.",
  "companyName": "Company name is required. The length must be between 2 and 64 characters.",
  "companyWebsite": "Company website is optional. The format should be valid. Ex. https://www.example.com.",
  "companyDescription": "Company description is optional. Maximum length is 1000 characters.",
  "companiesField": "Please select the company. The company is required."
}
