{
  "name": "Ad",
  "surname": "Soyad",
  "email": "E-Posta Adresi",
  "password": "Parola",
  "passwordRepeat": "Parola Tekrar",
  "signUp": "Kayıt Ol",
  "signIn": "Giriş Yap",
  "alreadyHaveAnAccount": "Zaten bir hesabın var mı? Giriş yap.",
  "success": "Başarılı",
  "close": "Kapat",
  "error": "Hata",
  "dontYouHaveAnAccount": "Hesabın yok mu? Kayıt ol.",
  "addNewItem": "Yeni Öğe Ekle",
  "cancel": "İptal",
  "save": "Kaydet",
  "easy": "Kolay",
  "fast": "Hızlı",
  "free": "Ücretsiz",
  "accountActivated": "Hesabınız aktifleştirildi. Hesabınıza giriş yapabilirsiniz.",
  "goToYourAccount": "Hesabınıza gidin",
  "dashboard": "Kontrol Paneli",
  "purchases": "Alışlar",
  "sales": "Satışlar",
  "products": "Ürünler",
  "settings": "Şirket Ayarları",
  "logout": "Çıkış Yap",
  "profile": "Profil",
  "phone": "Telefon Numarası",
  "saveSettings": "Ayarları Kaydet",
  "userSettings": "Kullanıcı Ayarları",
  "changePassword": "Parola Değiştir",
  "currentPassword": "Mevcut Parola",
  "newPassword": "Yeni Parola",
  "confirmPassword": "Parola Onayı",
  "updatePassword": "Parolayı Güncelle",
  "language": "Dil",
  "currency": "Para Birimi",
  "add": "Ekle",
  "edit": "Düzenle",
  "delete": "Sil",
  "active": "Aktif",
  "inactive": "Pasif",
  "isActive": "Aktif mi?",
  "description": "Açıklama",
  "status": "Durum",
  "deleteConfirmation": "Silmek istediğinize emin misiniz?",
  "yes": "Evet",
  "no": "Hayır",
  "companyName": "Şirket Adı",
  "country": "Ülke",
  "city": "Şehir",
  "address": "Adres",
  "zipCode": "Posta Kodu",
  "city-state": "Şehir/Eyalet",
  "city-district": "Şehir/İlçe/Bölge",
  "website": "Web Sitesi",
  "addressLine1": "Adres Satırı 1",
  "addressLine2": "Adres Satırı 2",
  "suppliers": "Tedarikçiler",
  "supplier": "Tedarikçi",
  "supplierName": "Tedarikçi Adı",
  "supplierSurname": "Tedarikçi Soyadı",
  "addANewSupplier": "Yeni Tedarikçi Ekle",
  "editSupplier": "Tedarikçiyi Düzenle",
  "searchAddress": "Adres Ara...",
  "searching": "Aranıyor...",
  "customers": "Müşteriler",
  "customerName": "Müşteri Adı",
  "customerSurname": "Müşteri Soyadı",
  "addANewCustomer": "Yeni Müşteri Ekle",
  "editCustomer": "Müşteriyi Düzenle",
  "title": "Başlık",
  "totalPrice": "Toplam Fiyat",
  "customer": "Müşteri",
  "date": "Tarih",
  "addANewSale": "Yeni Satış Ekle",
  "editSale": "Satışı Düzenle",
  "productName": "Ürün Adı",
  "price": "Fiyat",
  "quantity": "Miktar",
  "action": "İşlem",
  "product": "Ürün",
  "subtotal": "Ara Toplam",
  "availableInStock": "Stoktaki Miktar",
  "productType": "Ürün Tipi",
  "purchasePrice": "Alış Fiyatı",
  "salePrice": "Satış Fiyatı",
  "generalInfo": "Genel Bilgiler",
  "addressDetails": "Adres Detayları",
  "addANewProduct": "Yeni Ürün Ekle",
  "editProduct": "Ürünü Düzenle",
  "saleDetails": "Satış Detayları",
  "transactionIsPaid": "İşlem ödendi.",
  "returnToTable": "Tabloya Dön",
  "PENDING": "Beklemede",
  "COMPLETED": "Tamamlandı",
  "addANewPurchase": "Yeni Alış Ekle",
  "editPurchase": "Alışı Düzenle",
  "purchaseDetails": "Alış Detayları",
  "singularProduct": "Tekil Ürün",
  "totalProfit": "Toplam Kâr",
  "profit": "Kâr",
  "outOfStock": "Stokta Yok",
  "pendingSales": "Bekleyen Satışlar",
  "dailyProfitGrowth": "Günlük Kâr Artışı (Son ay)",
  "productTypeDistribution": "Ürün Tipi Dağılımı",
  "latest5CompletedSales": "Son 5 Tamamlanan Satış",
  "latest5CompletedPurchases": "Son 5 Tamamlanan Alış",
  "top5Customers": "En Çok Alış Yapan 5 Müşteri",
  "createdAt": "Oluşturulma Tarihi",
  "amount": "Miktar",
  "noDataAvailable": "Veri Yok",
  "company": "Şirket",
  "companies": "Şirketler",
  "noOptionsText": "Seçenek Yok",
  "easyDescription": "Envanter kontrol yönetimimizin kullanımı kolay ve sezgisel arayüzüyle envanterinizi kolayca düzenleyin ve takip edin.",
  "fastDescription": "Işık hızında envanter kontrol yönetim sistemimizle iş süreçlerinizi hızlandırın; stok seviyelerinizi verimli bir şekilde yönetin, iş akışlarınızı optimize edin ve hızlı sipariş yerleştirme sağlayın.",
  "freeDescription": "Bir kuruş harcamadan envanterinizi kontrol altına alın. Özellikleriyle dolu ve ücretsiz envanter kontrol yazılımımız, her ölçekteki işletmelerin stok seviyelerini optimize etmesine, israfı azaltmasına ve karlılığı maksimize etmesine olanak sağlar.",
  "forgotPasswordQuestion": "Parolanızı mı unuttunuz?",
  "forgottenPassword": "Parolamı Unuttum",
  "forgotPasswordDescription": "Parolanızı sıfırlamak için e-posta adresinizi girin. Size bir e-posta göndereceğiz.",
  "submit": "Gönder",
  "resetPassword": "Parolayı Sıfırla",
  "contactUs": "Bize Ulaşın",
  "contactUsDescription": "Bize ulaşmak için aşağıdaki formu doldurun. En kısa sürede size geri dönüş yapacağız.",
  "message": "Mesaj",
  "help": "Yardım",
  "/dashboard": "Gösterge tablosunda, son 5 tamamlanmış satış ve satın alma, ilk 5 müşteri, günlük kar artışı ve ürün tipi dağılımı, stokta olmayan ürünler, bekleyen satışlar, toplam kar ve tekil ürünü görebilirsiniz. Daha detaylı bilgi için bizimle iletişime geçebilirsiniz.<br><b>Not:</b> Günlük kâr artışı yalnızca içinde bulunulan ayın başından bu yana olan verileri gösterir.",
  "/purchases": "Satın almalar sayfasında, tüm satın almaların listesini görebilirsiniz. \"Ekle\" düğmesini tıklayarak yeni bir satın alma işlemi ekleyebilirsiniz. \"Düzenle\" düğmesini tıklayarak bir satın alma işlemini düzenleyebilirsiniz. \"İşlem ödendi.\" onay kutusunu işaretlerseniz satın alma işlemini düzenleyemezsiniz. Düzenlemenin tek yolu yönetici ile iletişime geçmektir. Silmeye izin verilmiyor. Listeyi gösterilen sütunlara göre filtreleyebilirsiniz. Listeyi PDF veya Excel dosyası olarak dışa aktarabilirsiniz.",
  "/sales": "Satış sayfasında tüm satışların listesini görebilirsiniz. \"Ekle\" düğmesini tıklayarak yeni bir satış ekleyebilirsiniz. \"Düzenle\" düğmesini tıklayarak bir satışı düzenleyebilirsiniz. \"İşlem ödendi.\" onay kutusunu işaretlerseniz satışı düzenleyemezsiniz. Düzenlemenin tek yolu yönetici ile iletişime geçmektir. Silmeye izin verilmiyor. Listeyi gösterilen sütunlara göre filtreleyebilirsiniz. Listeyi PDF veya Excel dosyası olarak dışa aktarabilirsiniz.",
  "/products": "Ürünler sayfasında tüm ürünlerin listesini görebilirsiniz. \"Ekle\" düğmesini tıklayarak yeni bir ürün ekleyebilirsiniz. \"Düzenle\" düğmesini tıklayarak bir ürünü düzenleyebilirsiniz. Onay kutusuna/kutularına tıkladıktan sonra \"Sil\" düğmesini tıklayarak bir ürünü silebilirsiniz. Çoklu silmeye izin verilir. Listeyi gösterilen sütunlara göre filtreleyebilirsiniz. Listeyi PDF veya Excel dosyası olarak dışa aktarabilirsiniz.",
  "/customers": "Müşteriler sayfasında, tüm müşterilerin listesini görebilirsiniz. \"Ekle\" düğmesini tıklayarak yeni bir müşteri ekleyebilirsiniz. \"Düzenle\" düğmesini tıklayarak bir müşteriyi düzenleyebilirsiniz. Onay kutularını/kutularını tıkladıktan sonra \"Sil\" düğmesini tıklayarak bir müşteriyi silebilirsiniz. Çoklu silmeye izin verilir. Listeyi gösterilen sütunlara göre filtreleyebilirsiniz. Listeyi PDF veya Excel dosyası olarak dışa aktarabilirsiniz.",
  "/suppliers": "Tedarikçiler sayfasında tüm tedarikçilerin listesini görebilirsiniz. \"Ekle\" düğmesini tıklayarak yeni bir tedarikçi ekleyebilirsiniz. \"Düzenle\" düğmesini tıklayarak bir tedarikçiyi düzenleyebilirsiniz. Onay kutu(lar)ına tıkladıktan sonra \"Sil\" düğmesini tıklayarak bir tedarikçiyi silebilirsiniz. Çoklu silmeye izin verilir. Listeyi gösterilen sütunlara göre filtreleyebilirsiniz. Listeyi PDF veya Excel dosyası olarak dışa aktarabilirsiniz.",
  "/purchases/add": "Her alanın doğrulamaları vardır. Alanla ilgili doğrulamalar ve bilgiler araç ipucunda görülebilir. \"İşlem ödendi.\" işaretlendikten sonra. Satın alma işlemini artık düzenleyemezsiniz.",
  "/purchases/edit": "Her alanın doğrulamaları vardır. Alanla ilgili doğrulamalar ve bilgiler araç ipucunda görülebilir. \"İşlem ödendi.\" işaretlendikten sonra. Satın alma işlemini artık düzenleyemezsiniz.",
  "/sales/add": "Her alanın doğrulamaları vardır. Alanla ilgili doğrulamalar ve bilgiler araç ipucunda görülebilir. \"İşlem ödendi.\" işaretlendikten sonra artık satışı düzenleyemezsiniz.",
  "/sales/edit": "Her alanın doğrulamaları vardır. Alanla ilgili doğrulamalar ve bilgiler araç ipucunda görülebilir. \"İşlem ödendi.\" işaretlendikten sonra artık satışı düzenleyemezsiniz.",
  "/products/add": "Her alanın doğrulamaları vardır. Alanla ilgili doğrulamalar ve bilgiler araç ipucunda görülebilir. Ürün Tipi gösterge tablosu sayfasında görülecektir. Sadece ürünün eklenmesi, stoka ekleneceği anlamına gelmez. O ürün için bir satın alma işlemi eklemeniz gerekiyor.",
  "/products/edit": "Her alanın doğrulamaları vardır. Alanla ilgili doğrulamalar ve bilgiler araç ipucunda görülebilir. <br> <b>Not:</b> Fiyatları düzenlerken dikkatli olmalısınız, veri uyuşmazlığına neden olabilir.",
  "/customers/add": "Her alanın doğrulamaları vardır. Alanla ilgili doğrulamalar ve bilgiler araç ipucunda görülebilir. Tarayıcıların otomatik tamamlamasını kullanıyorsanız, adres satırı 1 doğru doldurulmayabilir. Manuel olarak doldurmalısınız.",
  "/customers/edit": "Her alanın doğrulamaları vardır. Alanla ilgili doğrulamalar ve bilgiler araç ipucunda görülebilir. Tarayıcıların otomatik tamamlamasını kullanıyorsanız, adres satırı 1 doğru doldurulmayabilir. Manuel olarak doldurmalısınız.",
  "/suppliers/add": "Her alanın doğrulamaları vardır. Alanla ilgili doğrulamalar ve bilgiler araç ipucunda görülebilir.",
  "/suppliers/edit": "Her alanın doğrulamaları vardır. Alanla ilgili doğrulamalar ve bilgiler araç ipucunda görülebilir.",
  "/settings": "Ayarlar sayfasında şirket bilgilerinizi değiştirebilirsiniz. Şirketinizin adını, adresini, telefon numarasını, e-posta adresini vb. değiştirebilirsiniz. Tarayıcıların otomatik tamamlamasını kullanıyorsanız, adres satırı 1 doğru doldurulmayabilir. Manuel olarak doldurmalısınız. Seçilen para birimi ilgili sayfalarda görülecektir.",
  "/profile": "Profil sayfasında şifrenizi değiştirebilirsiniz. Mevcut şifrenizi ve yeni şifrenizi girmelisiniz. Yeni şifre en az 6 karakter uzunluğunda olmalıdır. Ad, soyad vb. değiştirebilirsiniz. E-posta değiştirilemez. Dil değiştirilirse, doğrudan yansıtılacaktır."
}
