{
  "onceSaleMarkedAsPaid": "Ödendi olarak işaretlendikten sonra satışı artık düzenleyemezsiniz.",
  "oncePurchaseMarkedAsPaid": "Ödendi olarak işaretlendikten sonra satın alımı artık düzenleyemezsiniz.",
  "customerName": "Müşteri adı gereklidir. Uzunluk 2 ile 30 karakter arasında olmalıdır.",
  "customerSurname": "Müşteri soyadı gereklidir. Uzunluk 2 ile 30 karakter arasında olmalıdır.",
  "emailAddress": "E-posta adresi gereklidir.",
  "phoneNumber": "Telefon numarası gereklidir. E.164 formatında olmalıdır. Örnek: +12345678901.",
  "addressLine1": "Adres satırı 1 gereklidir. Adresi yazıp kendinize uygun olanı seçebilirsiniz. Tarayıcılarda otomatik tamamlama düzgün çalışmayabilir.",
  "addressLine2": "Adres satırı 2 gereklidir. Uzunluk 3-120 olmalıdır. Buraya daire numaranızı, katınızı vb. yazabilirsiniz.",
  "supplierName": "Tedarikçi adı gereklidir. Uzunluk 2 ile 30 karakter arasında olmalıdır.",
  "supplierSurname": "Tedarikçi soyadı gereklidir. Uzunluk 2 ile 30 karakter arasında olmalıdır.",
  "productName": "Ürün adı gereklidir. Uzunluk 2 ile 100 karakter arasında olmalıdır.",
  "productDescription": "Ürün açıklaması opsiyoneldir. Uzunluk 3 ile 100 karakter arasında olmalıdır.",
  "productType": "Ürün tipi gereklidir. Uzunluk 2 ile 30 karakter arasında olmalıdır.",
  "productSalePrice": "Ürün satış fiyatı gereklidir. 0.01 ile 1000000 arasında olmalıdır.",
  "productPurchasePrice": "Ürün satın alma fiyatı gereklidir. 0.01 ile 1000000 arasında olmalıdır.",
  "saleCustomer": "Müşteri seçmelisiniz. Müşteri yoksa önce müşteri oluşturmalısınız.",
  "saleProduct": "Ürün seçmelisiniz. Ürün yoksa önce ürün oluşturmalısınız. Eğer ürün stokta yoksa önce ürünü satın almalısınız.",
  "saleQuantity": "Satış miktarı gereklidir. Miktar en az 1 olmalıdır. Maksimum değer ürünün stok miktarıdır.",
  "title": "Başlık gereklidir. Uzunluk 2 ile 100 karakter arasında olmalıdır.",
  "description": "Açıklama opsiyoneldir. Uzunluk 3 ile 100 karakter arasında olmalıdır.",
  "purchaseSupplier": "Tedarikçi seçmelisiniz. Tedarikçi yoksa önce tedarikçi oluşturmalısınız.",
  "purchaseProduct": "Ürün seçmelisiniz. Ürün yoksa önce ürün oluşturmalısınız.",
  "purchaseQuantity": "Satın alma miktarı gereklidir. Miktar en az 1 ve en fazla 999 olmalıdır.",
  "profileName": "Ad gereklidir. Uzunluk 2 ile 30 karakter arasında olmalıdır.",
  "profileSurname": "Soyad gereklidir. Uzunluk 2 ile 30 karakter arasında olmalıdır.",
  "profileEmail": "E-posta adresi değiştirilemez. Eğer e-posta adresinizi değiştirmek istiyorsanız destek ekibimizle iletişime geçin.",
  "profilePhoneNumber": "Telefon numarası opsiyoneldir. E.164 formatında olmalıdır. Örnek: +12345678901.",
  "language": "Uygulamayı kullanmak istediğiniz bir dili seçebilirsiniz. Varsayılan dil İngilizce'dir.",
  "profileTimezone": "Uygulamayı kullanmak istediğiniz bir saat dilimi seçebilirsiniz. Varsayılan saat dilimi UTC'dir.",
  "profileCurrency": "Uygulamayı kullanmak istediğiniz bir para birimi seçebilirsiniz. Varsayılan para birimi USD'dir. Seçilen para birimi uygulamadaki hesaplamalar için kullanılacaktır.",
  "currentPassword": "Mevcut şifre.",
  "newPassword": "Kullanmak istediğiniz yeni şifre. Uzunluk 6 ile 18 karakter arasında olmalıdır. Şifre en az bir büyük harf, bir küçük harf ve bir rakam içermelidir. Şu anki şifrenizle aynı olmamalıdır.",
  "confirmPassword": " Yeni şifrenizi tekrar girin.",
  "companyName": "Şirket adı gereklidir. Uzunluk 2 ile 64 karakter arasında olmalıdır.",
  "companyWebsite": "Şirket web sitesi opsiyoneldir. Website formatı doğru olmalıdır. Örnek: https://www.example.com.",
  "companyDescription": "Şirket açıklaması opsiyoneldir. Uzunluk en fazla 1000 karakter olmalıdır."
}
