{
  "onceSaleMarkedAsPaid": "Gdy sprzedaż zostanie oznaczona jako opłacona, nie można już jej edytować.",
  "oncePurchaseMarkedAsPaid": "Gdy zakup zostanie oznaczony jako opłacony, nie można już go edytować.",
  "customerName": "Nazwa klienta jest wymagana. Długość musi zawierać się w przedziale od 2 do 30 znaków.",
  "customerSurname": "Nazwisko klienta jest wymagane. Długość musi zawierać się w przedziale od 2 do 30 znaków.",
  "emailAddress": "Adres e-mail jest wymagany.",
  "phoneNumber": "Telefon jest wymagany. Musi to być format E.164. Przykład: +12345678901.",
  "addressLine1": "Wiersz adresu 1 jest wymagany. Możesz wpisać adres i wybrać odpowiedni dla siebie. Autouzupełnianie w przeglądarkach może nie działać poprawnie.",
  "addressLine2": "Wiersz adresu 2 jest wymagany. Długość musi wynosić 3-120. Tutaj możesz wpisać numer swojego mieszkania, piętro itp.",
  "supplierName": "Nazwa dostawcy jest wymagana. Długość musi zawierać się w przedziale od 2 do 30 znaków.",
  "supplierSurname": "Nazwisko dostawcy jest wymagane. Długość musi zawierać się w przedziale od 2 do 30 znaków.",
  "productName": "Nazwa produktu jest wymagana. Długość musi zawierać się w przedziale od 2 do 100 znaków.",
  "productDescription": "Opis produktu jest opcjonalny. Długość musi zawierać się w przedziale od 3 do 100 znaków.",
  "productType": "Typ produktu jest wymagany. Długość musi zawierać się w przedziale od 2 do 30 znaków.",
  "productSalePrice": "Cena sprzedaży produktu jest wymagana. Musi wynosić min 0.01 i max 1000000.",
  "productPurchasePrice": "Cena zakupu produktu jest wymagana. Musi wynosić min 0.01 i max 1000000.",
  "saleCustomer": "Klient jest wymagany. Jeśli nie masz żadnych klientów, musisz najpierw utworzyć klienta.",
  "saleProduct": "Produkt jest wymagany. Jeśli nie masz żadnych produktów, musisz najpierw utworzyć produkt. Jeśli produkt jest niedostępny, musisz go najpierw utworzyć.",
  "saleQuantity": "Ilość jest wymagana. Musi wynosić min 1. Max jest zależny od dostępności produktu.",
  "title": "Tytuł jest wymagany. Długość musi zawierać się w przedziale od 2 do 100 znaków.",
  "description": "Opis jest wymagany. Długość musi zawierać się w przedziale od 3 do 100 znaków.",
  "purchaseSupplier": "Dostawca jest wymagany. Jeśli nie masz żadnych dostawców, musisz najpierw utworzyć dostawcę.",
  "purchaseProduct": "Produkt jest wymagany. Jeśli nie masz żadnych produktów, musisz najpierw utworzyć produkt. Jeśli produkt jest niedostępny, musisz go najpierw utworzyć.",
  "purchaseQuantity": "Ilość jest wymagana. Musi wynosić min 1 i max 999.",
  "profileName": "Imię jest wymagane. Długość musi zawierać się w przedziale od 2 do 30 znaków.",
  "profileSurname": "Nazwisko jest wymagane. Długość musi zawierać się w przedziale od 2 do 30 znaków.",
  "profileEmail": "Nie można zaktualizować adresu e-mail. Jeśli chcesz to zmienić, musisz skontaktować się z zespołem pomocy technicznej.",
  "profilePhoneNumber": "Telefon jest opcjonalny. Musi to być format E.164. Przykład: +12345678901.",
  "language": "Możesz wybrać język, którego chcesz używać. Domyślnym językiem jest angielski.",
  "profileTimezone": "Możesz wybrać strefę czasową, w której chcesz pracować. Domyślną strefą czasową jest UTC.",
  "profileCurrency": "Możesz wybrać walutę, której chcesz używać. Domyślną walutą jest USD. Ta waluta będzie używana do wszystkich obliczeń.",
  "currentPassword": "Aktualne hasło.",
  "newPassword": "Nowe hasło to hasło, którego chcesz użyć. Musi mieć od 6 do 18 znaków. Musi zawierać co najmniej jedną wielką literę, jedną małą literę i jedną cyfrę. Nie może być takie samo jak aktualne hasło.",
  "confirmPassword": "Potwierdź hasło jest takie samo jak nowe hasło.",
  "companyName": "Nazwa firmy jest wymagana. Długość musi zawierać się w przedziale od 2 do 64 znaków.",
  "companyWebsite": "Strona firmowa jest opcjonalna. Format powinien być prawidłowy. Były. https://www.example.com.",
  "companyDescription": "Opis firmy jest opcjonalny. Maksymalna długość to 1000 znaków.",
  "companiesField": "Proszę wybrać firmy. Firmy są wymagane."
}
